"""
Запрос для поиска профессионалов по Яндекс.Директу
"""
yandex_direct_professionals = {
    "$and": [
        {
            "$text": {
                "$search": "рся прокторинг маркетолог таргетолог контекст adwords smm лендинг seo -барабан -курсы -такси -промокод -водитель -продается -продам -продажа -продаётся -фотостудия -панели -книга -альбом -рюкзак -синтезатор -обучение -оберег -квартира -акустика -кроссовки -квадрокоптер -фотограф ",

            }
        },
        {
            "phoneNumber": {
                "$exists": True
            }
        }]
}

"""
Недвижимость в Екатеринбурге рядом с точкой
"""
estate_ekb_near_point = {

    "$and": [
        {
            "parameters.flat.0.description": "Коммерческая недвижимость"
        },
        {
            "parameters.flat.description": {
                "$ne": "Офисное помещение"
            }
        },
        {
            "location": {
                "$exists": True
            }
        },
        {
            "location": {
                "$near": {
                    "$geometry": {
                        "type": "Point",
                        "coordinates": [
                            60.571037,
                            56.832265
                        ]
                    },
                    "$maxDistance": 1000
                }
            }
        }
    ]
}
