"""
Профессионалы по Яндекс.Директу
"""
yandex_direct_professionals = {
    "$and": [
        {
            "$text": {
                "$search": "рся прокторинг маркетолог таргетолог контекст adwords smm лендинг seo -барабан -курсы -такси -промокод -водитель -продается -продам -продажа -продаётся -фотостудия -панели -книга -альбом -рюкзак -синтезатор -обучение -оберег -квартира -акустика -кроссовки -квадрокоптер -фотограф ",

            }
        },
        {
            "phoneNumber": {
                "$exists": True
            }
        }]
}

"""
Мамашки, имеющие детей с 1 по 5 класс
"""
moms_have_kids_1_5_grade = {
    "$and": [
        {
            "userType": "private"
        },
        {
            "parameters.flat": {
                "$elemMatch": {
                    "$or": [
                        {
                            "description": "122-128 см (6-8 лет)"
                        },
                        {
                            "description": "134-140 см (8-10 лет)"
                        },
                        {
                            "description": "146-152 см (10-12 лет)"
                        },

                    ]
                }
            }
        },
        {
            "parameters.flat": {
                "$elemMatch": {
                    "description": "Б/у"
                }
            }
        }
    ]
}
