"""
Запрос для поиска профессионалов по Яндекс.Директу
"""
yandex_direct_professionals = {
    "$and": [
        {
            "$text": {
                "$search": "рся прокторинг маркетолог таргетолог контекст adwords smm лендинг seo -барабан -курсы -такси -промокод -водитель -продается -продам -продажа -продаётся -фотостудия -панели -книга -альбом -рюкзак -синтезатор -обучение -оберег -квартира -акустика -кроссовки -квадрокоптер -фотограф ",

            }
        },
        {
            "phoneNumber": {
                "$exists": True
            }
        }]
}

"""
Недвижимость в Екатеринбурге рядом с точкой
"""
estate_ekb_near_point = {

    "$and": [
        {
            "parameters.flat.0.description": "Коммерческая недвижимость"
        },
        {
            "parameters.flat.description": {
                "$ne": "Офисное помещение"
            }
        },
        {
            "location": {
                "$exists": True
            }
        },
        {
            "location": {
                "$near": {
                    "$geometry": {
                        "type": "Point",
                        "coordinates": [
                            60.571037,
                            56.832265
                        ]
                    },
                    "$maxDistance": 1000
                }
            }
        }
    ]
}

"""
Мамашки, имеющие детей с 1 по 5 класс
"""
moms_have_kids_1_5_grade = {
    "$and": [
        {
            "userType": "private"
        },
        {
            "parameters.flat": {
                "$elemMatch": {
                    "$or": [
                        {
                            "description": "122-128 см (6-8 лет)"
                        },
                        {
                            "description": "134-140 см (8-10 лет)"
                        },
                        {
                            "description": "146-152 см (10-12 лет)"
                        },

                    ]
                }
            }
        },
        {
            "parameters.flat": {
                "$elemMatch": {
                    "description": "Б/у"
                }
            }
        }
    ]
}

"""
Васильевский остров
"""
vasilievskiy_ostrov = {
    "location": {
        "$geoWithin": {
            "$geometry": {
                "type": "Polygon",
                "coordinates": [
                    [
                        [
                            30.263591,
                            59.919012
                        ],
                        [
                            30.288643,
                            59.935872
                        ],
                        [
                            30.288448,
                            59.934892
                        ],
                        [
                            30.309820,
                            59.945555
                        ],
                        [
                            30.264244,
                            59.956815
                        ],
                        [
                            30.177383,
                            59.969274
                        ],
                        [
                            30.164852,
                            59.930506
                        ],
                        [
                            30.263591,
                            59.919012
                        ]
                    ]
                ]
            }
        }
    }
}
"""
Кудрово
"""

kudrovo = {
    "location": {
        "$geoWithin": {
            "$geometry": {
                "type": "Polygon",
                "coordinates": [
                    [
                        [
                            30.500879,
                            59.910847
                        ],
                        [
                            30.497446,
                            59.893544
                        ],
                        [
                            30.524611,
                            59.897763
                        ],
                        [
                            30.524440,
                            59.945555
                        ],
                        [
                            30.524440,
                            59.915300
                        ],
                        [
                            30.500879,
                            59.910847
                        ]
                    ]
                ]
            }
        }
    }
}
